// Задача 27: Напишите программу, которая принимает на вход число и выдаёт сумму цифр в числе.
// 452 -> 11
// 82 -> 10
// 9012 -> 12

int Sum(string number)
    {
        int[] numbers = Array.ConvertAll(text.Split(),int.Parse);
    }

Console.WriteLine("Введите число - ");
int num=Convert.ToInt32(Console.ReadLine());
string Text=Convert.ToString(n);
Sum(Text);
